---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarShapeStartHookOffset
source: html/c3c7ed2d-0ef2-f263-c66c-7352c06bfb97.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarShapeStartHookOffset Property

"Start Hook Offset Length"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarShapeStartHookOffset { get; }
```